<a href="https://colab.research.google.com/github/BraulioHermanson/t_scratch/blob/main/Pivot_%26_Reshap.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
import numpy as np
import pandas as pd

In [14]:
df = pd.read_excel('/content/teste.xlsx')

In [15]:
df

  caract    fruta    mês  valor
0      C  laranja  março     18
1      C     maça  março      8
2      C     pera  março     17
3      C  laranja  Abril      1
4      C     maça  Abril      8
5      C     pera  Abril     12
6      C  laranja   Maio      8
7      C     maça   Maio      1
8      C     pera   Maio      2

In [31]:
table = pd.pivot_table(df, values="valor", index=["caract", "mês"], columns=["fruta"])

In [32]:
table

fruta         laranja  maça  pera
caract mês
C      Abril        1     8    12
       Maio         8     1     2
       março       18     8    17

In [40]:
reshaped_df =  table.rename_axis(None, axis=1).reset_index()

In [41]:
reshaped_df

  caract    mês  laranja  maça  pera
0      C  Abril        1     8    12
1      C   Maio        8     1     2
2      C  março       18     8    17